In [97]:
import pandas as pd
import numpy as np

# Creando un dataframe

In [98]:
df = pd.read_csv(r'mastermind-220421-143506.csv', 
                 index_col=[0])

In [99]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [100]:
list(df['especialidad'])

['Hardware',
 'Edición de vídeo',
 'Programación',
 'Programación',
 'Sistemas Operativos',
 'Robótica',
 'Hacking']

Desde un diccionario

In [101]:
datos = {'nombre':['SFDX Show', 'Sara Nogark', 'Nate Gentile', 'Bettatech', 'Antonio Sarosi', 'Edgar Pons', 's4vitar'],
        'especialidad':list(df['especialidad']),
        'edad':[np.random.randint(28, 31) for i in range(len(df['nombre']))],
        'visitas':[np.random.randint(100000, 150000) for i in range(len(df['nombre']))]}

In [102]:
df_inventado = pd.DataFrame(datos)

In [103]:
df_inventado

           nombre         especialidad  edad  visitas
0       SFDX Show             Hardware    30   102490
1     Sara Nogark     Edición de vídeo    28   100857
2    Nate Gentile         Programación    29   140522
3       Bettatech         Programación    28   148545
4  Antonio Sarosi  Sistemas Operativos    28   119988
5      Edgar Pons             Robótica    30   124745
6         s4vitar              Hacking    29   141636

In [104]:
df_inventado['sexo'] = list(df['sexo'])

In [105]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   102490    H
1     Sara Nogark     Edición de vídeo    28   100857    M
2    Nate Gentile         Programación    29   140522    H
3       Bettatech         Programación    28   148545    H
4  Antonio Sarosi  Sistemas Operativos    28   119988    H
5      Edgar Pons             Robótica    30   124745    H
6         s4vitar              Hacking    29   141636    H

# Explorando un dataframe

In [106]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.head()

In [107]:
df.head(2)

        nombre      especialidad  edad  visitas sexo
0    SFDX Show          Hardware    30   130855    H
1  Sara Nogark  Edición de vídeo    29   114175    M

In [108]:
df.tail(2)

       nombre especialidad  edad  visitas sexo
5  Edgar Pons     Robótica    29   143620    H
6     s4vitar      Hacking    28   132567    H

## df.sample()

In [109]:
df.sample(3)

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
1     Sara Nogark     Edición de vídeo    29   114175    M

## df.info()

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

In [111]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

In [112]:
df.describe()['edad']['max']

31.0

## df.shape()

In [113]:
df.shape

(7, 5)

## df.columns

In [114]:
df.columns

Index(['nombre', 'especialidad', 'edad', 'visitas', 'sexo'], dtype='object')

In [115]:
df.columns = ['nombre', 'especialidad', 'edad', 'visitas', 'sexo'] # podemos cambiar  los nombres de las columnas

In [116]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.index

In [117]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# eleccion de elementos (subset)

## acceso mediante etiquetas

df[columna][fila]

In [118]:
df['especialidad'][2]

'Programación'

In [119]:
df['nombre'] == 'Nate Gentile'

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: nombre, dtype: bool

In [120]:
df[df['nombre'] == 'Nate Gentile']

         nombre  especialidad  edad  visitas sexo
2  Nate Gentile  Programación    31   142545    H

In [121]:
df[df['nombre'] == 'Nate Gentile']['especialidad']

2    Programación
Name: especialidad, dtype: object

In [122]:
mas_viejos = df[df['edad'] == 30]['nombre']

In [123]:
mas_viejos

0    SFDX Show
Name: nombre, dtype: object

## df.iloc[]

df.iloc[indice fila, indice columna]

In [124]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc

df.loc[etiqueta indice, etiqueta columna]

In [125]:
df.loc[2, 'especialidad']

'Programación'

In [126]:
df.loc[2, :'edad']

nombre          Nate Gentile
especialidad    Programación
edad                      31
Name: 2, dtype: object

In [127]:
df.iloc[2,0:2] == df.loc[2, 'nombre':'especialidad']

nombre          True
especialidad    True
Name: 2, dtype: bool

# Manipulacion de datos

## Cambiar indice

### df.set_index()

In [128]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [129]:
df_nuevo = df.set_index('nombre')

In [130]:
df_nuevo

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [131]:
df.set_index('nombre', 
             inplace=True)

In [132]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [133]:
df.reset_index()

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [134]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [135]:
df_nuevo.head()

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H

In [136]:
df_nuevo.loc[['Nate Gentile', 's4vitar'], ['visitas', 'edad']]

              visitas  edad
nombre
Nate Gentile   142545    31
s4vitar        132567    28

## df.apply()

In [137]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición de vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

In [138]:
df.select_dtypes(include='int64')

                edad  visitas
nombre
SFDX Show         30   130855
Sara Nogark       29   114175
Nate Gentile      31   142545
Bettatech         31   149462
Antonio Sarosi    28   132008
Edgar Pons        29   143620
s4vitar           28   132567

In [139]:
df.select_dtypes(include='int64').apply(np.sqrt)

                    edad     visitas
nombre
SFDX Show       5.477226  361.738856
Sara Nogark     5.385165  337.897914
Nate Gentile    5.567764  377.551321
Bettatech       5.567764  386.603156
Antonio Sarosi  5.291503  363.329052
Edgar Pons      5.385165  378.972295
s4vitar         5.291503  364.097514

In [140]:
df['especialidad mayus'] = df['especialidad'].apply(lambda x: x.upper())

In [141]:
n = np.array(list(range(5)))

In [142]:
n

array([0, 1, 2, 3, 4])

In [143]:
mas_1 = lambda x: x + 1

In [144]:
mas_1(n)

array([1, 2, 3, 4, 5])

In [145]:
df

                       especialidad  edad  visitas sexo   especialidad mayus
nombre
SFDX Show                  Hardware    30   130855    H             HARDWARE
Sara Nogark        Edición de vídeo    29   114175    M     EDICIÓN DE VÍDEO
Nate Gentile           Programación    31   142545    H         PROGRAMACIÓN
Bettatech              Programación    31   149462    H         PROGRAMACIÓN
Antonio Sarosi  Sistemas Operativos    28   132008    H  SISTEMAS OPERATIVOS
Edgar Pons                 Robótica    29   143620    H             ROBÓTICA
s4vitar                     Hacking    28   132567    H              HACKING

In [146]:
df['especialidad'] = df['especialidad'].apply(lambda x: x.title())

In [147]:
df

                       especialidad  edad  visitas sexo   especialidad mayus
nombre
SFDX Show                  Hardware    30   130855    H             HARDWARE
Sara Nogark        Edición De Vídeo    29   114175    M     EDICIÓN DE VÍDEO
Nate Gentile           Programación    31   142545    H         PROGRAMACIÓN
Bettatech              Programación    31   149462    H         PROGRAMACIÓN
Antonio Sarosi  Sistemas Operativos    28   132008    H  SISTEMAS OPERATIVOS
Edgar Pons                 Robótica    29   143620    H             ROBÓTICA
s4vitar                     Hacking    28   132567    H              HACKING

## df.drop()

In [148]:
df.drop('especialidad mayus', 
        inplace=True, 
        axis=1)

In [149]:
df

                       especialidad  edad  visitas sexo
nombre
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición De Vídeo    29   114175    M
Nate Gentile           Programación    31   142545    H
Bettatech              Programación    31   149462    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
Edgar Pons                 Robótica    29   143620    H
s4vitar                     Hacking    28   132567    H

## df.drop_duplicates()

In [150]:
new_df = df.copy()

In [151]:
new_df.drop_duplicates('edad', 
                       keep='last')

            especialidad  edad  visitas sexo
nombre
SFDX Show       Hardware    30   130855    H
Bettatech   Programación    31   149462    H
Edgar Pons      Robótica    29   143620    H
s4vitar          Hacking    28   132567    H

## df.nlargest()

In [152]:
df.nlargest(3, 'visitas')

              especialidad  edad  visitas sexo
nombre
Bettatech     Programación    31   149462    H
Edgar Pons        Robótica    29   143620    H
Nate Gentile  Programación    31   142545    H

### df.sort_values

In [153]:
df.sort_values(by='visitas', 
               ascending=False)

                       especialidad  edad  visitas sexo
nombre
Bettatech              Programación    31   149462    H
Edgar Pons                 Robótica    29   143620    H
Nate Gentile           Programación    31   142545    H
s4vitar                     Hacking    28   132567    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
SFDX Show                  Hardware    30   130855    H
Sara Nogark        Edición De Vídeo    29   114175    M

## df.nsmallest()

In [154]:
df.nsmallest(len(df), 'visitas')

                       especialidad  edad  visitas sexo
nombre
Sara Nogark        Edición De Vídeo    29   114175    M
SFDX Show                  Hardware    30   130855    H
Antonio Sarosi  Sistemas Operativos    28   132008    H
s4vitar                     Hacking    28   132567    H
Nate Gentile           Programación    31   142545    H
Edgar Pons                 Robótica    29   143620    H
Bettatech              Programación    31   149462    H

In [155]:
df.nsmallest(len(df), 'visitas') == df.sort_values(by='visitas')

                especialidad  edad  visitas  sexo
nombre
Sara Nogark             True  True     True  True
SFDX Show               True  True     True  True
Antonio Sarosi          True  True     True  True
s4vitar                 True  True     True  True
Nate Gentile            True  True     True  True
Edgar Pons              True  True     True  True
Bettatech               True  True     True  True

In [156]:
df.sort_values(by=['edad', 'visitas'], 
               ascending=False)

                       especialidad  edad  visitas sexo
nombre
Bettatech              Programación    31   149462    H
Nate Gentile           Programación    31   142545    H
SFDX Show                  Hardware    30   130855    H
Edgar Pons                 Robótica    29   143620    H
Sara Nogark        Edición De Vídeo    29   114175    M
s4vitar                     Hacking    28   132567    H
Antonio Sarosi  Sistemas Operativos    28   132008    H

## df.values_counts()

In [157]:
df.value_counts('edad')

edad
28    2
29    2
31    2
30    1
dtype: int64

## df.rename()

In [158]:
df.rename(columns={'edad':'viejo'})

                       especialidad  viejo  visitas sexo
nombre
SFDX Show                  Hardware     30   130855    H
Sara Nogark        Edición De Vídeo     29   114175    M
Nate Gentile           Programación     31   142545    H
Bettatech              Programación     31   149462    H
Antonio Sarosi  Sistemas Operativos     28   132008    H
Edgar Pons                 Robótica     29   143620    H
s4vitar                     Hacking     28   132567    H

# Funciones avanzadas

In [159]:
df.reset_index(inplace=True)

In [160]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [161]:
df_nuevo = df.copy()

## pd.concat()

In [162]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [163]:
df_nuevo

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [164]:
df_nuevo['nombre'] = ['batman', 'spiderman', 'superman', 'thor', 'aironman', 'hulk', 'loki']

In [165]:
df_nuevo

      nombre         especialidad  edad  visitas sexo
0     batman             Hardware    30   130855    H
1  spiderman     Edición De Vídeo    29   114175    M
2   superman         Programación    31   142545    H
3       thor         Programación    31   149462    H
4   aironman  Sistemas Operativos    28   132008    H
5       hulk             Robótica    29   143620    H
6       loki              Hacking    28   132567    H

In [166]:
pd.concat([df, df_nuevo]).reset_index(drop=True)

            nombre         especialidad  edad  visitas sexo
0        SFDX Show             Hardware    30   130855    H
1      Sara Nogark     Edición De Vídeo    29   114175    M
2     Nate Gentile         Programación    31   142545    H
3        Bettatech         Programación    31   149462    H
4   Antonio Sarosi  Sistemas Operativos    28   132008    H
5       Edgar Pons             Robótica    29   143620    H
6          s4vitar              Hacking    28   132567    H
7           batman             Hardware    30   130855    H
8        spiderman     Edición De Vídeo    29   114175    M
9         superman         Programación    31   142545    H
10            thor         Programación    31   149462    H
11        aironman  Sistemas Operativos    28   132008    H
12            hulk             Robótica    29   143620    H
13            loki              Hacking    28   132567    H

## df.where()

In [167]:
filtro1 = df['especialidad'] == 'Programación'
filtro2 = df['visitas'] > 145000

In [168]:
df.where(filtro1 & filtro2)

      nombre  especialidad  edad   visitas sexo
0        NaN           NaN   NaN       NaN  NaN
1        NaN           NaN   NaN       NaN  NaN
2        NaN           NaN   NaN       NaN  NaN
3  Bettatech  Programación  31.0  149462.0    H
4        NaN           NaN   NaN       NaN  NaN
5        NaN           NaN   NaN       NaN  NaN
6        NaN           NaN   NaN       NaN  NaN

In [169]:
df.where(filtro1 & filtro2).dropna().loc[:, 'nombre']

3    Bettatech
Name: nombre, dtype: object

## df.groupby()

In [170]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [171]:
df.groupby('especialidad').sum()

                     edad  visitas
especialidad
Edición De Vídeo       29   114175
Hacking                28   132567
Hardware               30   130855
Programación           62   292007
Robótica               29   143620
Sistemas Operativos    28   132008

In [172]:
df.groupby('sexo').max()

           nombre         especialidad  edad  visitas
sexo
H         s4vitar  Sistemas Operativos    31   149462
M     Sara Nogark     Edición De Vídeo    29   114175

In [173]:
df.groupby(['sexo', 'especialidad']).max()

                                  nombre  edad  visitas
sexo especialidad
H    Hacking                     s4vitar    28   132567
     Hardware                  SFDX Show    30   130855
     Programación           Nate Gentile    31   149462
     Robótica                 Edgar Pons    29   143620
     Sistemas Operativos  Antonio Sarosi    28   132008
M    Edición De Vídeo        Sara Nogark    29   114175

## pd.pivot_table()

In [174]:
pd.pivot_table(df, 
               index='sexo', 
               columns='edad')

       visitas
edad        28        29        30        31
sexo
H     132287.5  143620.0  130855.0  146003.5
M          NaN  114175.0       NaN       NaN

In [175]:
pd.pivot_table(df, 
               index='sexo', 
               columns='edad', 
               aggfunc=np.sum)

       visitas
edad        28        29        30        31
sexo
H     264575.0  143620.0  130855.0  292007.0
M          NaN  114175.0       NaN       NaN

In [176]:
pd.pivot_table(df, 
               index=['sexo'], 
               values=['nombre'], 
               columns=['especialidad'], 
               aggfunc=np.max)

                       nombre                                                \
especialidad Edición De Vídeo  Hacking   Hardware  Programación    Robótica
sexo
H                         NaN  s4vitar  SFDX Show  Nate Gentile  Edgar Pons
M                 Sara Nogark      NaN        NaN           NaN         NaN


especialidad Sistemas Operativos
sexo
H                 Antonio Sarosi
M                            NaN

# Fechas

## Creando fechas

In [177]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición De Vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [178]:
len(df)

7

In [179]:
fecha = pd.date_range(start= '1 January 2021', 
                      end= '1 July 2021', 
                      freq= 'MS')

In [180]:
'2021/01/01' == fecha[0]

False

In [181]:
fecha[0]

Timestamp('2021-01-01 00:00:00', freq='MS')

In [182]:
fecha

DatetimeIndex(['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01',
               '2021-05-01', '2021-06-01', '2021-07-01'],
              dtype='datetime64[ns]', freq='MS')

In [183]:
df.set_index(pd.DatetimeIndex(fecha), 
             inplace=True)

In [184]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7 entries, 2021-01-01 to 2021-07-01
Freq: MS
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

In [185]:
df

                    nombre         especialidad  edad  visitas sexo
2021-01-01       SFDX Show             Hardware    30   130855    H
2021-02-01     Sara Nogark     Edición De Vídeo    29   114175    M
2021-03-01    Nate Gentile         Programación    31   142545    H
2021-04-01       Bettatech         Programación    31   149462    H
2021-05-01  Antonio Sarosi  Sistemas Operativos    28   132008    H
2021-06-01      Edgar Pons             Robótica    29   143620    H
2021-07-01         s4vitar              Hacking    28   132567    H

In [186]:
df.index

DatetimeIndex(['2021-01-01', '2021-02-01', '2021-03-01', '2021-04-01',
               '2021-05-01', '2021-06-01', '2021-07-01'],
              dtype='datetime64[ns]', freq='MS')

In [187]:
formato = '%d/%m/%Y'

In [188]:
df.index.strftime(formato)

Index(['01/01/2021', '01/02/2021', '01/03/2021', '01/04/2021', '01/05/2021',
       '01/06/2021', '01/07/2021'],
      dtype='object')

In [189]:
df.index = df.index.strftime(formato)

In [190]:
df

                    nombre         especialidad  edad  visitas sexo
01/01/2021       SFDX Show             Hardware    30   130855    H
01/02/2021     Sara Nogark     Edición De Vídeo    29   114175    M
01/03/2021    Nate Gentile         Programación    31   142545    H
01/04/2021       Bettatech         Programación    31   149462    H
01/05/2021  Antonio Sarosi  Sistemas Operativos    28   132008    H
01/06/2021      Edgar Pons             Robótica    29   143620    H
01/07/2021         s4vitar              Hacking    28   132567    H